def task5(point_a, point_b):
    """
    Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
    Пример:
        - A (3,6); B (2,1) -> 5,09
        - A (7,-5); B (1,-1) -> 7,21
    """
    return round((((point_b[0] - point_a[0]) ** 2) + ((point_b[1] - point_a[1]) ** 2)) ** 0.5, 2)


print(task5((int(input("x1: ")), int(input("y1: "))), (int(input("x2: ")), int(input("y2: ")))))